public class Note {
/*  Java中的8种基本变量类型
    整型
        byte  8位     -2^7 ~ 2^7-1    1字节
        short 16位    -2^15 ~ 2^15-1  2字节
        int   32位    -2^31 ~ 2^31-1  4字节
        long  64位    -2^63 ~ 2^63-1  8字节
        给各类型赋值时，若超出取值范围，会出现编译错误
    字符型
        char用于存放字符，值用单引号 ‘’表示，长度16位或2字节
        char 只能存放一个字符，超过一个字符就会产生编译错误
    浮点型
        float  32位 4字节
        double 64位 8字节
        默认小数值是double类型
        所以 float f = 54.321会出现编译错误，
        因为54.321的默认类型是 double，其类型 长度为64，超过了float的长度32
        在数字后面加一个字母f，直接把该数字声明成float类型
        float f2 = 54.321f
    布尔型
        boolean表示真假，长度为1





*/



}
